Hey @BeyondEvil , 

Thanks for tagging me here. I can confirm the behavior still exists.

I'm going to put more code samples here to demonstrate why addressing this probably isn't a good use of Terragrunt resources right now, if it even is feasibly addressable.

Looking at the behavior of a simple fixture:

```hcl
# terragrunt.hcl
inputs = {
  name = "something"
}
```

```hcl
# main.tf
variable "name" {
  type    = any
  default = null
}

resource "local_file" "example" {
  filename = var.name
  content  = "Hello, World!"
}
```

We can still reproduce this issue. 

```
* Failed to execute "tofu plan" in .
  ╷
  │ Error: Variables not allowed
  │
  │   on <value for var.name> line 1:
  │   (source code not available)
  │
  │ Variables may not be used here.
  ╵

  exit status 1
```

If we take the recommended fix and JSON encode the value before we send it down as the environment variable `TF_VAR_name`, however, we'll see that it does indeed work around the issue:

```hcl
inputs = {
  name = jsonencode("something")
}
```

```
  # local_file.example will be created
  + resource "local_file" "example" {
      + content              = "Hello, World!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "something"
      + id                   = (known after apply)
    }
```

Also note, however, that properly typed variables will experience a regression if we do this:

```hcl
# main.tf
variable "name" {
  type    = string
  default = null
}

resource "local_file" "example" {
  filename = var.name
  content  = "Hello, World!"
}
```

```
  # local_file.example will be created
  + resource "local_file" "example" {
      + content              = "Hello, World!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "\"something\""
      + id                   = (known after apply)
    }
```

I'm referring to `filename` being set to `"\"something\""`.

The idea of parsing `.tf` files to uncover whether Terragrunt should do some hidden jsonencoding on behalf of the user _might_ work, but there are some problems with it.

1. It would incur a performance penalty for every Terragrunt run to evaluate the correctness of performing a preemptive json encode.
2. It would require performing OpenTofu/Terraform initialization before HCL parsing is performed and inputs are set as `TF_VAR_` environment variables.

The first would happen, as Terragrunt would have to scan and parse all the `.tf` files that might be used in a run for variables with `any` types, and the second would happen, as `.tf` files might reference modules that have variables with `any` types somewhere in their configurations.

Deciding not to tackle this because the alternative is to have users either set types explicitly or explicitly using `jsonencode` for `any` types seems like the more sensible course of action for now.

If someone has an alternate solution that's preferred that wouldn't incur those two penalties, I'd welcome an enhancement issue to document the proposal.

Closing out this issue, as it has gone stale, there are documented workarounds, and it's not clear what would be an acceptable solution that doesn't degrade the experience of most Terragrunt users. 

Thank you for reporting this @antonbabenko , and providing the workaround.